[{"id":0,"name":"","description":"","imagePath":"","skinSets":[]},{"id":10,"name":"Arclight","description":"Once each millenium an ancient, godlike entity descends from the heavens, choosing worthy warriors to be his will incarnate. These beings are the Arclight—immortal agents of the light divine.","imagePath":"","skinSets":[24,33]},{"id":11,"name":"Battlecast","description":"The glorious revolution is here! Assembling an army of machines with living brains, Viktor marches against the combined forces of his enemies—with only a scrappy human-led resistance keeping him from total world domination.","imagePath":"","skinSets":[25]},{"id":12,"name":"Steel Valkyries","description":"A galaxy scarred by war now attempts to rebuild, but the old wounds remain. Criminals, bounty hunters, mercenaries, and assassins have filled the power vacuum, piloting dangerous combat exo-suits with godlike abilities.","imagePath":"","skinSets":[65,76]},{"id":13,"name":"Culinary Masters","description":"","imagePath":"","skinSets":[26]},{"id":14,"name":"Headhunter","description":"For some species, the hunt is more than mere sport—it possesses their minds and bodies, molding them into a race of perfect killing machines.","imagePath":"","skinSets":[30]},{"id":15,"name":"Guardian of the Sands","description":"Powerful guardians stand watch over the tomb of an ancient horror, so that it may never threaten the world again. But they may already be too late...","imagePath":"","skinSets":[66]},{"id":16,"name":"Sugar Rush","description":"From the Gingerbread Castle to the Root Beer Sea, the Licorice Mountains to the Gumdrop Forest—this is the Candy Kingdom in all its glory.","imagePath":"","skinSets":[57]},{"id":17,"name":"Toy Box","description":"Gnar's toy chest is brimming with priceless treasures, but when no one's home, his toys take on a life of their own...","imagePath":"","skinSets":[61]},{"id":18,"name":"Lost Empire","description":"The city-states of the Great Desert have long been lost to time, but their ruins—and the ancient pharaohs who once ruled them—lie hidden just beneath the sands.","imagePath":"","skinSets":[67]},{"id":19,"name":"Woad Tribe","description":"","imagePath":"","skinSets":[68]},{"id":1,"name":"Star Guardian","description":"In a vast and dark universe, young warriors are chosen by fate to protect the light of the stars. They are destined to burn bright, but collapse as furiously as they shine.","imagePath":"","skinSets":[19,20,119]},{"id":20,"name":"Blood Moon","description":"An ancient cult, seeking irresistible power, surfaces on nights of the Blood Moon to perform profane, esoteric rites—merging their flesh with demonic spirits, and becoming one with an ever greater darkness.","imagePath":"","skinSets":[12]},{"id":21,"name":"Prehistoric Hunters","description":"","imagePath":"","skinSets":[32]},{"id":22,"name":"Storybook","description":"","imagePath":"","skinSets":[71,41]},{"id":23,"name":"Fables","description":"","imagePath":"","skinSets":[72]},{"id":24,"name":"Versus","description":"","imagePath":"","skinSets":[77,78,125,124]},{"id":25,"name":"Mecha","description":"When colossal kaiju begin attacking from the sea, land, and air, humanity develops equally powerful mecha units to stop them in explosive hand-to-hand combat.","imagePath":"","skinSets":[35,79]},{"id":26,"name":"Hextech","description":"Now at the forefront of science and art, Hextech has evolved from its rudimentary beginnings into a modern renaissance of intricate, artificial lifeforms capable of free will. Skilled artificers lead the medium into a bold new future -- but what it will bring, none can say.","imagePath":"","skinSets":[40]},{"id":28,"name":"Snowdown","description":"","imagePath":"","skinSets":[46,48,47]},{"id":29,"name":"Crime City","description":"","imagePath":"","skinSets":[51]},{"id":2,"name":"Warring Kingdoms","description":"Rival empires vie for power as they attempt to unify the lands, while brave warriors and stoic generals test their skill against the greatest heroes of the era. It is a time of war, and a time of legends.","imagePath":"","skinSets":[53]},{"id":30,"name":"Immortal Journey","description":"Long ago, in an ancient land, many souls gathered beneath the gods to test the limits of their power. Foolish and arrogant, brave and just, their journeys are written into the immortal pages of history…","imagePath":"","skinSets":[81]},{"id":31,"name":"High Noon Gothic","description":"At the height of the industrial revolution, travelers begin pouring into the untamed west, searching for fortune and prosperity among the unknown horrors of a cruel and ancient world. It is a time of brave gunslingers and rotten scoundrels, inscrutable gods, and savage demons.","imagePath":"","skinSets":[39]},{"id":32,"name":"Odyssey","description":"From the urbanized coreworlds to the outermost edge of the galaxy, adventure awaits! The great Demaxian Empire ignores the objections of the Templar Order and the criminal Syndicate alike in their pursuit of ora—a mysterious golden essence that serves as the lifeblood of all civilization, and promises untold power to those who can wield it for themselves…","imagePath":"","skinSets":[73]},{"id":33,"name":"PROJECT","description":"Among the mega-structures and packed streets of a future controlled by global corporations, a shadow war rages between rebellious, augmented humans, and newly empowered artificial beings. The winners will shape the course of history… and the losers will be forced to evolve.","imagePath":"","skinSets":[18,17]},{"id":34,"name":"Eclipse","description":"Long ago, an order of monastic knights slew the vile gods of the old world, using esoteric powers granted by the moon and sun. Now the world has grown dark and violent, as those selfsame deities prepare their return—challenged only by the light of the eclipse.","imagePath":"","skinSets":[93,92,58,62]},{"id":36,"name":"Mecha Kingdoms","description":"The Great Kingdoms warred for generations until the arrival of a new enemy. To fight back, they are blessed with gifts from the heavens. Will they rise above their past to save their future?","imagePath":"","skinSets":[127]},{"id":37,"name":"Spirit Blossom","description":"The Spirit Blossom Festival is an ancient and celebrated time in Ionia, when the door to the spirit world is opened, the dead return to their loved ones, and spirits of all manner turn their eyes towards the living. From the benevolent Kanmei, to the obsessive Akana—their stories play out again and again, like shadows on a paper lantern.","imagePath":"","skinSets":[131,132]},{"id":38,"name":"PsyOps","description":"The crown jewel of military black ops, the PsyOps unit are an elite team of psychic soldiers deployed against rogue militaries and supernatural threats. Officially, they don't exist. But when conventional warfare won't cut it and the stakes are no less than the fate of the world, PsyOps answers the call.","imagePath":"","skinSets":[133,134]},{"id":39,"name":"Dragonmancers","description":"Majestic dragons dwell in remote places of wild beauty, avoiding mortal affairs outside of rarely bestowing their gifts on only a select few. The Dragonmancers are those fortunate and powerful enough to have gained the ultimate blessing. Whether they then use that for good or for evil is up to them, and anyone strong enough to stop them.","imagePath":"","skinSets":[135]},{"id":3,"name":"Worldbreaker","description":"In the end, the moon will smother the sun. And in that hopeless dawn, four titans will rise to shatter the world itself.","imagePath":"","skinSets":[29]},{"id":40,"name":"Battle Queens","description":"Once fractured by endless warfare, the collective Queendoms of Elysia have realized the true nature of their world: that the magic holding their fantastical plane together is maintained only through conflict. They have thus allied through the unifying conflict of the Grand Coronation, though some alliances are beginning to show cracks...","imagePath":"","skinSets":[137]},{"id":41,"name":"The Ruined King Saga","description":"The Black Mist gathers, the Harrowing comes, and the Ruined King has risen once more. Viego's corruption blankets Runeterra, turning friends into foes and bringing entire nations to their knees. The only ones with the power to stop him are the Sentinels of Light: an ancient order led by Senna and Lucian. They must call upon champions from every corner of the realm to fight back the Black Mist and end the Ruined King's reign of terror once and for all.","imagePath":"","skinSets":[138,147]},{"id":42,"name":"Shan Hai Scrolls","description":"","imagePath":"","skinSets":[139]},{"id":43,"name":"Crystal Rose","description":"In a world of frequently-broken magical alliances and centuries-old grudges, the annual Crystal Rose Festival offers a neutral ground for the powerful to forgive slights and renegotiate truces. Weapons are ostensibly left at the door, and potential new pacts are signaled by picking and wearing the magical roses that grow only during the festival.","imagePath":"","skinSets":[140,141]},{"id":44,"name":"Lunar Beast","description":"Each year, a mischievous Lunar Beast arrives in the mortal realm, drawn to the New Year's celebrations. And each year, the corresponding Lunar God selects a squad of chosen champions to lead the beast on a merry chase and protect the city from the creature's playful rampage. The Lunar Parade is a beloved part of the New Year's festivities and the Beast itself brings good luck once it's been lulled to rest by the squad's efforts. When a Lunar Beast is well-entertained and well-rested, it always signals a prosperous New Year!","imagePath":"","skinSets":[142]},{"id":45,"name":"Space Groove","description":"In a groovy galaxy a million disco infernos away, a mysterious energy known only as The Groove brings music and prosperity to trillions of galactic citizens. But when the alien overlord Lissandra and her army of Harsh Vibes begin to enslave planets and suppress disco music, a new age of heroes rises to stop her, and keep the party grooving.","imagePath":"","skinSets":[144]},{"id":46,"name":"Arcana","description":"High above Arcana, the Archetypes, living patterns that shape reality itself, struggle to trace their vision upon the chaos below them. The Archetypes recruit perceptive citizens of the world below to amplify their hidden patterns—and the more who magnify an Archetype's pattern, the more the world reflects their grand design.","imagePath":"","skinSets":[146]},{"id":47,"name":"Cyberpop","description":"In the vibrant underground of Sound City, hackers, skaters, rebels, and rogues band together away from the prying eyes of powerful cyber-corporate overlords.","imagePath":"","skinSets":[148]},{"id":48,"name":"Crime City Nightmare","description":"Eldritch horrors lurk within the crime and grime of Valoran City. Black markets have given rise to Elixirs: a valuable substance of dubious origin whose production spells money and influence should any gang corner the market. Spurred on by agents of corruption, capos and cronies alike look to forces beyond the veil for a taste of true power.","imagePath":"","skinSets":[149]},{"id":49,"name":"Phoenixmancers","description":"Only the truest hearts are blessed by the divine fenghuang, a legendary phoenix who watches over the world. Her champions receive a single feather—each one containing unimaginable elemental power, granting them the means needed to protect all that is innocent and good from forces lurking in the shadows. ","imagePath":"","skinSets":[150]},{"id":4,"name":"Pulsefire","description":"After unlocking the secrets of time travel, these champions are thrust into a far-flung dystopian future. While Chrono-enforcers relentlessly pursue them across time and space, a small few have escaped into history—taking their technology along for the ride.","imagePath":"","skinSets":[36,90]},{"id":5,"name":"Event Horizon","description":"In the vast darkness of space are born terrible, beautiful things—Cosmic creatures of sublime love, and the unknowable monstrosities of the Dark Star. These are the children of silent gods, and they are finally coming home.","imagePath":"","skinSets":[43,44]},{"id":6,"name":"Dragon World","description":"Twice did dragonfire consume the world. Twice from the embers were heroes forged.","imagePath":"","skinSets":[13]},{"id":0,"name":"Omega Squad","description":"When the war came, Omega Squad was sent to end it. Now only one of them remains, a yordle with no battles left to fight but his own...","imagePath":"","skinSets":[14]},{"id":8,"name":"Pentakill","description":"In a world where heavy metal reigns supreme, PENTAKILL are the undisputed masters of melting the face right off your head. Six members, two penta-platinum albums, and the chrome-fisted fury of the gods themselves. It's time to rock!","imagePath":"","skinSets":[16]},{"id":9,"name":"Riftquest","description":"Danger lurks in the land of Runeterra! Powerful monsters, dastardly sorcerers, and mythical creatures roam unchecked! Gather your friends and create your own adventure for 3-5 players, vanquishing evil with each roll of the die. Do you have what it takes to save the world, and become a legend of RIFTQUEST?","imagePath":"","skinSets":[38]}]